{
  "guide": "LES",
  "version": "GIIS-B013-02-03",
  "encoding": "windows-1252",
  "delimiter": "|",
  "listDelimiter": "&",
  "subattrDelimiter": "#",
  "fields": [
    {
      "id": 1,
      "name": "clues",
      "description": "Clave Única de Establecimientos en Salud",
      "type": {
        "kind": "string",
        "maxLength": 11
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Se debe registrar el valor del campo CLUES que corresponda a la Unidad Médica donde se otorgó la atención de acuerdo al catálogo ESTABLECIMIENTO DE SALUD."
    },
    {
      "id": 2,
      "name": "folio",
      "description": "Clave asignada por la Unidad Médica, para dar seguimiento al registro",
      "type": {
        "kind": "string",
        "maxLength": 8
      },
      "requiredColumn": true,
      "confidential": true,
      "validationRaw": "El folio no debe repetirse para una misma CLUES en la misma fecha de atención. Longitud mínima de 1 máxima de 8 caracteres numéricos. Los caracteres válidos son 0 – 9."
    },
    {
      "id": 3,
      "name": "curpPaciente",
      "description": "Clave Única de Registro de Población del paciente",
      "type": {
        "kind": "string",
        "maxLength": 18
      },
      "requiredColumn": true,
      "confidential": true,
      "validationRaw": "Se deben omitir espacios al inicio y al final de la variable, con una longitud de 18 caracteres. Debe ir en mayúsculas. Validada por RENAPO. De conformidad con el Instructivo Normativo para la Asignación de la Clave Única de Registro de Población. Se debe validar que el valor de la variable cumpla con la estructura “AAAA999999AAAAAAX9”. Deben tener coincidencia con las variables: “nombre”, “primerApellido”, “segundoApellido”, “fechaNacimiento”, “entidadNacimiento” y “sexo”. La CURP del profesional de salud responsable de la atención debe ser diferente de la CURP del Paciente a excepción del valor genérico. Por excepción, si no se cuenta con la información de la CURP se debe registrar el valor genérico “XXXX999999XXXXXX99” y omitir la validación con las variables asociadas."
    },
    {
      "id": 4,
      "name": "nombre",
      "description": "Nombre(s) del Paciente",
      "type": {
        "kind": "string",
        "maxLength": 50
      },
      "requiredColumn": true,
      "confidential": true,
      "validationRaw": "La longitud máxima es de 50 caracteres. Debe tener al menos dos caracteres. Los caracteres válidos son sólo de A – Z, incluyendo Ñ, en mayúsculas. En caso de nombre compuesto, debe ir separado por un espacio o en su caso “-”, “,” o “.” y no se acepta ningún otro tipo de carácter especial, ni acentos. Esta variable se debe validar contra el valor registrado en la variable “curpPaciente”."
    },
    {
      "id": 5,
      "name": "primerApellido",
      "description": "Primer apellido del paciente",
      "type": {
        "kind": "string",
        "maxLength": 50
      },
      "requiredColumn": true,
      "confidential": true,
      "validationRaw": "La longitud máxima es de 50 caracteres. Debe tener al menos dos caracteres. Se deben omitir espacios en blanco al inicio y al final de la variable. Los caracteres válidos son sólo de A – Z, incluyendo Ñ, en mayúsculas. En caso de nombre compuesto, debe ir separado por un espacio o en su caso “-”, “,” o “.” y no se acepta ningún otro tipo de carácter especial, ni acentos. Esta variable se debe validar contra el valor registrado en la variable “curpPaciente”. En caso de no contar con el primer apellido se debe registrar el valor “XX”."
    },
    {
      "id": 6,
      "name": "segundoApellido",
      "description": "Segundo apellido del paciente",
      "type": {
        "kind": "string",
        "maxLength": 50
      },
      "requiredColumn": true,
      "confidential": true,
      "validationRaw": "La longitud máxima es de 50 caracteres. Debe tener al menos dos caracteres. Se deben omitir espacios en blanco al inicio y al final de la variable. Los caracteres válidos son sólo de A – Z, incluyendo Ñ, en mayúsculas. En caso de nombre compuesto, debe ir separado por un espacio o en su caso “-”, “,” o “.” y no se acepta ningún otro tipo de carácter especial, ni acentos. Esta variable se debe validar contra el valor registrado en la variable “curpPaciente”. En caso de no contar con el segundo apellido, se debe registrar el valor “XX”."
    },
    {
      "id": 7,
      "name": "fechaNacimiento",
      "description": "Fecha de nacimiento del paciente.",
      "type": {
        "kind": "string",
        "maxLength": 10
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Se deben omitir espacios en blanco al inicio y al final de la variable. Debe contener el día, mes y año bajo el siguiente formato: dd/mm/aaaa. La longitud es de 8 dígitos y 2 caracteres especiales “/”. La fecha de nacimiento del paciente no puede ser mayor a la fecha de atención. Esta variable se debe validar contra el valor registrado en la variable “curpPaciente”. La edad del paciente no debe ser mayor a 100 años. Si se desconoce la fecha, se debe registrar el valor “09/09/9999”."
    },
    {
      "id": 8,
      "name": "paisOrigen",
      "description": "Identificador del país de nacimiento del paciente.",
      "type": {
        "kind": "numeric"
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Se debe registrar el valor del campo CATALOG_KEY que corresponda al país de nacimiento de acuerdo con el catálogo PAIS. Si no está descrito en la Hoja de Lesiones o se desconoce el dato, se debe registrar el valor “248 – NO ESPECIFICADO”."
    },
    {
      "id": 9,
      "name": "entidadNacimiento",
      "description": "Entidad federativa de nacimiento del paciente",
      "type": {
        "kind": "string",
        "maxLength": 2
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Si el valor de la variable “paisOrigen” es “142 – MÉXICO”, se debe registrar el valor del campo CATALOG_KEY que corresponda a la entidad de nacimiento de acuerdo al catálogo ENTIDAD FEDERATIVA. En caso contrario, se debe registrar el valor “88 – NO APLICA”. 99 – SE IGNORA (si se desconoce el dato) 00 – NO ESPECIFICADO. Esta variable se debe validar contra el valor registrado en la variable “curpPaciente”."
    },
    {
      "id": 10,
      "name": "escolaridad",
      "description": "Nivel de escolaridad",
      "type": {
        "kind": "numeric"
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Si la edad del paciente es mayor o igual a “3 años”, se debe registrar el valor del campo CATALOG_KEY que corresponda de acuerdo al catálogo ESCOLARIDAD, con excepción de las opciones técnicas terminales. En caso contrario, se debe registrar el valor “88 – NO APLICA”. Si el paciente no tiene escolaridad, se debe registrar el valor “1 – NINGUNA”. Si la edad del paciente es menor de 5 años no se debe registrar clave de escolaridad superior a “32 – PRIMARIA INCOMPLETA”."
    },
    {
      "id": 11,
      "name": "sabeLeerEscribir",
      "description": "Identificación de la habilidad del paciente para leer y escribir.",
      "type": {
        "kind": "numeric"
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Si la edad del paciente es mayor o igual a “3 años”, se debe registrar una de las siguientes opciones: 1 – SI 2 – NO 9 – SE IGNORA En caso contrario, se debe registrar el valor “2 – NO”. Si el valor de la variable “escolaridad” es superior o igual a “32 – PRIMARIA INCOMPLETA”, se debe registrar el valor “1 – SI”."
    },
    {
      "id": 12,
      "name": "sexo",
      "description": "Sexo del paciente",
      "type": {
        "kind": "numeric"
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Se debe registrar el valor del campo CATALOG_KEY que corresponda al sexo del paciente de acuerdo al catálogo SEXO. Esta variable se debe validar contra el valor registrado en la variable “curpPaciente”. Cuando se tenga una CURP valida (no genérica) solo se podrán registrar los valores “1 – HOMBRE” o “2 – MUJER”. En caso de que se tenga una CURP Genérica, se podrá registrar cualquiera de las opciones del catálogo. Si el valor es “3 – INTERSEXUAL” se debe pedir confirmación del dato."
    },
    {
      "id": 13,
      "name": "derechohabiencia",
      "description": "Institución del SNS en la cual se encuentran afiliados los usuarios de los servicios de salud",
      "type": {
        "kind": "numeric"
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Con base en el catálogo AFILIACION, se debe registrar una de las siguientes opciones: 0 – NO ESPECIFICADO 1 – NINGUNA 2 – IMSS 3 – ISSSTE 4 – PEMEX 5 – SEDENA 6 – SEMAR 8 – OTRA 10 – IMSS BIENESTAR 11 – ISSFAM 13 – INSABI 99 – SE IGNORA Si se desconoce el dato, se debe registrar el valor “99 – SE IGNORA”."
    },
    {
      "id": 14,
      "name": "gratuidad",
      "description": "Programa de Salud de la Ciudad de México",
      "type": {
        "kind": "numeric"
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Si de acuerdo al valor registrado en la variable “clues” el campo CLAVE DE LA ENTIDAD del catálogo ESTABLECIMIENTO DE SALUD tiene el valor “09 – CIUDAD DE MÉXICO” y el valor de la variable “derechohabiencia” es “8 – OTRA”, se debe registrar una de las siguientes opciones: 1 – SI 2 – NO En caso contrario, se debe registrar el valor “8 – NO APLICA”."
    },
    {
      "id": 15,
      "name": "seConsideraIndigena",
      "description": "¿Se considera Indígena?",
      "type": {
        "kind": "numeric"
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Se debe registrar una de las siguientes opciones: 1 – SI 2 – NO Para los menores de 5 años que sean hijos de alguna persona que se asuma indígena, se debe registrar el valor 1 – SI."
    },
    {
      "id": 16,
      "name": "hablaLenguaIndigena",
      "description": "¿Habla alguna lengua Indígena?",
      "type": {
        "kind": "numeric"
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Se debe registrar una de las siguientes opciones: 1 – SI 2 – NO"
    },
    {
      "id": 17,
      "name": "cualLengua",
      "description": "¿Cuál lengua Indígena habla?",
      "type": {
        "kind": "string",
        "maxLength": 4
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Si el valor registrado en la variable “hablaLenguaIndigena” es “1 – SI”, se debe registrar el valor del campo CLAVE_LENGUA que corresponda a la lengua indígena de acuerdo con el catálogo LENGUA_INDIGENA. En caso contrario, se debe registrar el valor “-1”."
    },
    {
      "id": 18,
      "name": "seConsideraAfromexicano",
      "description": "¿Se considera Afromexicano?",
      "type": {
        "kind": "numeric"
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Se debe registrar una de las siguientes opciones: 1 – SI 2 – NO Para los menores de 5 años que sean hijos de alguna persona que se asuma como afromexicana, se debe registrar el valor “1 - SI”."
    },
    {
      "id": 19,
      "name": "mujerFertil",
      "description": "Identifica si la mujer se encuentra o estuvo embarazada recientemente.",
      "type": {
        "kind": "numeric"
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Si el valor de la variable “sexo” es “2 – MUJER” y la edad del paciente es mayor o igual a “9 años” y menor o igual a “59 años”, se debe registrar una de las siguientes opciones: 1 – EMBARAZO 2 – PUERPERIO (de 0 a 42 días después del evento obstétrico) 3 – NO ESTABA EMBARAZADA NI EN EL PUERPERIO En caso contrario, se debe registrar el valor “-1”."
    },
    {
      "id": 20,
      "name": "edadGestacional",
      "description": "Semanas de gestación",
      "type": {
        "kind": "numeric"
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Si el valor de la variable “mujerFertil” es “1 – EMBARAZO” o “2 – PUERPERIO”, se debe registrar el número de semanas de gestación. En caso contrario, se debe registrar el valor “0”. La longitud debe ser de máximo 2 dígitos. El rango permitido es de “1” a “45” semanas. Si se desconoce el dato, se debe registrar el valor “99”."
    },
    {
      "id": 21,
      "name": "discapacidad",
      "description": "Identificación de alguna discapacidad preexistente.",
      "type": {
        "kind": "numeric"
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Se debe registrar una de las siguientes opciones: 1 – SI 2 – NO 9 – SE IGNORA"
    },
    {
      "id": 22,
      "name": "usuarioReferido",
      "description": "Identificación de la institución que refiere al paciente.",
      "type": {
        "kind": "numeric"
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Se debe registrar una de las siguientes opciones: 1 – UNIDAD MÉDICA 2 – PROCURACIÓN DE JUSTICIA 3 – SECRETARIA DE EDUCACION 4 – DESARROLLO SOCIAL 5 – DIF 6 – OTRAS INSTITUCIONES GUBERNAMENTALES 7 – INSTITUCIONES NO GUBERNAMENTALES 8 – SIN REFERENCIA (Iniciativa Propia)"
    },
    {
      "id": 23,
      "name": "cluesReferido",
      "description": "Clave Única del Establecimiento de Salud de la Unidad de la cual es referido el paciente.",
      "type": {
        "kind": "string",
        "maxLength": 11
      },
      "requiredColumn": false,
      "confidential": false,
      "validationRaw": "Si el valor de la variable “usuarioReferido” es “1 – UNIDAD MÉDICA”, se debe registrar el valor del campo CLUES que corresponda a la Unidad Médica de referencia de acuerdo con el catálogo ESTABLECIMIENTO DE SALUD. En caso contrario, se debe dejar vacío. Se debe validar que el campo ESTATUS DE OPERACIÓN de la CLUES registrada sea igual a “En Operación” o en su caso “Fuera de Operación” y el número de días entre el valor del campo FECHA EFECTIVA DE BAJA y el valor de la variable “fechaAtencion” sea menor a 90 días. El valor de la CLUES de referencia no debe ser igual al valor registrado en la variable “clues”."
    },
    {
      "id": 24,
      "name": "fechaEvento",
      "description": "Fecha en la que ocurrió el evento",
      "type": {
        "kind": "string",
        "maxLength": 10
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Se deben omitir espacios en blanco al inicio y al final de la variable. Debe contener el día, mes y año bajo el siguiente formato: dd/mm/aaaa. La longitud es de 8 dígitos y 2 caracteres especiales “/”. La fecha del evento debe ser menor o igual a la fecha de atención. La fecha del evento debe ser mayor o igual a la fecha de nacimiento."
    },
    {
      "id": 25,
      "name": "horaEvento",
      "description": "Hora en la que ocurrió el evento",
      "type": {
        "kind": "string",
        "maxLength": 5
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "El registro de la hora del evento debe ser en horas y minutos en el siguiente formato de 24 horas: HH:MM. Si no se encuentra descrito en la Hoja de Lesiones, se debe registrar el valor “99:99”."
    },
    {
      "id": 26,
      "name": "diaFestivo",
      "description": "¿El día se considera festivo?",
      "type": {
        "kind": "numeric"
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Se debe registrar una de las siguientes opciones: 1 – SI 2 – NO"
    },
    {
      "id": 27,
      "name": "sitioOcurrencia",
      "description": "¿Sitio de ocurrencia del evento?",
      "type": {
        "kind": "numeric"
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Se debe registrar el valor del campo CATALOG_KEY que corresponda al sitio donde ocurrió el evento de acuerdo con el catálogo SITIO_OCURRENCIA_LESION."
    },
    {
      "id": 28,
      "name": "entidadOcurrencia",
      "description": "Entidad de la ocurrencia del evento.",
      "type": {
        "kind": "string",
        "maxLength": 2
      },
      "requiredColumn": true,
      "confidential": true,
      "validationRaw": "Se debe registrar el valor del campo CATALOG_KEY que corresponda a la entidad donde ocurrió el evento de acuerdo al catálogo ENTIDAD FEDERATIVA. 99 – SE IGNORA (si se desconoce el dato) 00 – NO ESPECIFICADO (Si no está descrito en la Hoja de Lesiones)."
    },
    {
      "id": 29,
      "name": "municipioOcurrencia",
      "description": "Municipio de la ocurrencia del evento.",
      "type": {
        "kind": "string",
        "maxLength": 3
      },
      "requiredColumn": true,
      "confidential": true,
      "validationRaw": "Se debe registrar el valor del campo CATALOG_KEY que corresponda al municipio donde ocurrió el evento de acuerdo con el catálogo MUNICIPIO. Los municipios deben estar relacionados con el valor registrado en la variable “entidadOcurrencia”. Si el valor de la variable “entidadOcurrencia” es “99 – SE IGNORA” o no se conoce el dato, se debe registrar el valor “998 – SE IGNORA”. Si el valor de la variable “entidadOcurrencia” es “00 – NO ESPECIFICADO” o no se encuentra descrito en la Hoja de Lesiones, se debe registrar el valor “999 – NO ESPECIFICADO”."
    },
    {
      "id": 30,
      "name": "localidadOcurrencia",
      "description": "Localidad de ocurrencia del evento.",
      "type": {
        "kind": "string",
        "maxLength": 4
      },
      "requiredColumn": true,
      "confidential": true,
      "validationRaw": "Se debe registrar el valor del campo CATALOG_KEY que corresponda a la localidad donde ocurrió el evento de acuerdo con el catálogo LOCALIDAD. Las localidades deben estar relacionadas con los valores registrados en las variables “entidadOcurrencia” y “municipioOcurrencia”. Si el valor de la variable “municipioOcurrencia” es “998 – SE IGNORA” o se ignora el dato, se debe registrar el valor “9998 – SE IGNORA”. Si el valor de la variable “municipioOcurrencia” es “999 – NO ESPECIFICADO” o no se encuentre descrito en la Hoja de Lesiones, se debe registrar el valor “9999 – NO ESPECIFICADO”."
    },
    {
      "id": 31,
      "name": "otraLocalidad",
      "description": "Especificación del nombre de la localidad",
      "type": {
        "kind": "string",
        "maxLength": 50
      },
      "requiredColumn": false,
      "confidential": false,
      "validationRaw": "Si el valor registrado en la variable “localidadOcurrencia” es “9999 – NO ESPECIFICADO”, se puede registrar el nombre de la localidad. Se deben omitir espacios en blanco al inicio y al final de la variable. Los caracteres válidos son 0 – 9, A – Z y Ñ en mayúsculas, sin acentos, sin caracteres especiales a excepción de “.”, “;”, “-”, “_”, “/”, “(”, “)” y sin salto de línea."
    },
    {
      "id": 32,
      "name": "codigoPostal",
      "description": "Código Postal de la ocurrencia del evento.",
      "type": {
        "kind": "string",
        "maxLength": 5
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Se debe registrar el valor del campo D_CODIGO que corresponda al código postal donde ocurrió el evento de acuerdo con el catálogo CODIGO_POSTAL. Los códigos postales deben estar ligados con los valores registrados en las variables “entidadOcurrencia” y “municipioOcurrencia”. Si se desconoce el código postal de ocurrencia, se debe registrar el valor “99999 – SE IGNORA”. Si no se encuentra descrito en la Hoja de Lesiones, se debe registrar el valor “00000 – NO ESPECIFICADO”."
    },
    {
      "id": 33,
      "name": "tipoVialidad",
      "description": "Clasificación dada a la vialidad de ocurrencia del evento.",
      "type": {
        "kind": "numeric"
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Se debe registrar el valor del campo CATALOG_KEY que corresponda al tipo de vialidad donde ocurrió el evento de acuerdo al catálogo TIPO_VIALIDAD. Si se desconoce el dato, se debe registrar el valor “98 – SE IGNORA”. Si no se encuentra descrito en la Hoja de Lesiones, se debe registrar el valor “99 – NO ESPECIFICADO”."
    },
    {
      "id": 34,
      "name": "nombreVialidad",
      "description": "Nombre de la vialidad de la ocurrencia del evento.",
      "type": {
        "kind": "string",
        "maxLength": 100
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Se deben omitir espacios en blanco al inicio y al final de la variable. Los caracteres válidos son 0 – 9, A – Z y Ñ en mayúsculas, sin acentos, sin caracteres especiales a excepción de “.”, “;”, “-”, “_”, “/”, “(”, “)” y sin salto de línea. Si se desconoce el dato, se debe registrar el texto “SIN INFORMACIÓN”. Si no se encuentra descrito en la Hoja de Lesiones, se debe registrar el texto “NO ESPECIFICADO”."
    },
    {
      "id": 35,
      "name": "numeroExterior",
      "description": "Identificación del inmueble de la ocurrencia del evento.",
      "type": {
        "kind": "string",
        "maxLength": 15
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Se deben omitir espacios en blanco al inicio y al final de la variable. La longitud máxima es de 15 caracteres. Los caracteres válidos son 0 – 9, A – Z y Ñ en mayúsculas, sin acentos y sin caracteres especiales. Si se desconoce el dato, se debe registrar el valor “0”."
    },
    {
      "id": 36,
      "name": "tipoAsentamiento",
      "description": "Descripción del tipo de asentamiento de ocurrencia del evento.",
      "type": {
        "kind": "numeric"
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Se debe registrar el valor del campo CATALOG_KEY que corresponda al tipo de asentamiento donde ocurrió el evento de acuerdo al catálogo TIPO_ASENTAMIENTO. Si se desconoce el dato, se debe registrar el valor “45 – SE IGNORA”. Si no se encuentra descrito en la Hoja de Lesiones, se debe registrar el valor “46 – NO ESPECIFICADO”."
    },
    {
      "id": 37,
      "name": "nombreAsentamiento",
      "description": "Nombre de Asentamiento",
      "type": {
        "kind": "string",
        "maxLength": 100
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Se deben omitir espacios en blanco al inicio y al final de la variable. Los caracteres válidos son 0 – 9, A – Z y Ñ en mayúsculas, sin acentos, sin caracteres especiales a excepción de “.”, “;”, “-”, “_”, “/”, “(”, “)” y sin salto de línea. Si se desconoce el dato, se debe registrar el texto “SIN INFORMACIÓN”. Si no se encuentra descrito en la Hoja de Lesiones, se debe registrar el texto “NO ESPECIFICADO”."
    },
    {
      "id": 38,
      "name": "atencionPreHospitalaria",
      "description": "Identificación en caso de proporcionar atención prehospitalaria al paciente.",
      "type": {
        "kind": "numeric"
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Se debe registrar una de las siguientes opciones: 1 – SI 2 – NO"
    },
    {
      "id": 39,
      "name": "tiempoTrasladoUH",
      "description": "Tiempo transcurrido desde la atención prehospitalaria y el arribo a la unidad médica",
      "type": {
        "kind": "string",
        "maxLength": 5
      },
      "requiredColumn": false,
      "confidential": false,
      "validationRaw": "Si el valor de la variable “atencionPreHospitalaria” es “1 – SI”, se debe registrar el tiempo transcurrido en el traslado en horas y minutos, en el siguiente formato: HH:MM. En caso contrario, se debe dejar vacío. Rango permitido de 00:01 a 48:00. Si se desconoce el dato, se debe registrar el valor “99:99”."
    },
    {
      "id": 40,
      "name": "sospechaBajoEfectosDe",
      "description": "¿Se encontraba bajo el efecto del alcohol o droga?",
      "type": {
        "kind": "string",
        "maxLength": 5
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Se debe registrar al menos una de las siguientes opciones: 1 – ALCOHOL 2 – DROGA POR INDICACION MEDICA 3 – DROGAS ILEGALES 4 – SE IGNORA 5 – NINGUNA Se debe registrar como máximo 3 sustancias tóxicas. Si se identifica más de una sustancia tóxica, los valores deben ir separados por “&”. Si se registran los valores “4 – SE IGNORA” o “5 – NINGUNA” no se debe registrar ningún otro valor."
    },
    {
      "id": 41,
      "name": "intencionalidad",
      "description": "Intencionalidad del evento",
      "type": {
        "kind": "numeric"
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Se debe registrar una de las siguientes opciones: 1 – ACCIDENTAL 2 – VIOLENCIA FAMILIAR 3 – VIOLENCIA NO FAMILIAR 4 – AUTO INFLIGIDO 11 – TRATA DE PERSONAS"
    },
    {
      "id": 42,
      "name": "eventoRepetido",
      "description": "Identificación de evento repetido",
      "type": {
        "kind": "numeric"
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Se debe registrar una de las siguientes opciones: 1 – UNICA VEZ 2 – REPETIDO"
    },
    {
      "id": 43,
      "name": "agenteLesion",
      "description": "Agente que produjo la lesión",
      "type": {
        "kind": "numeric"
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Si el valor de la variable “intencionalidad” es “1 – ACCIDENTAL” o “4 – AUTO INFLIGIDO” o si el valor de la variable “tipoViolencia” es “6 – VIOLENCIA FÍSICA” o “7 – VIOLENCIA SEXUAL”, se debe registrar el valor del campo CATALOG_KEY que corresponda de acuerdo al catálogo AGENTE_LESION. En caso contrario, se debe registrar el valor “27 – NO APLICA”. Si se desconoce el agente de la lesión, se debe registrar el valor “26 – SE IGNORA”."
    },
    {
      "id": 44,
      "name": "especifique",
      "description": "Especifique el agente causal",
      "type": {
        "kind": "string",
        "maxLength": 50
      },
      "requiredColumn": false,
      "confidential": false,
      "validationRaw": "Si el valor de la variable “agenteLesion” es “25 – OTRA”, se debe registrar el agente causal de la lesión. En caso contrario, se debe dejar vacío. Se deben omitir espacios en blanco al inicio y al final de la variable. Los caracteres válidos son 0 – 9, A – Z y Ñ en mayúsculas, sin acentos, sin caracteres especiales a excepción de “.”, “;”, “-”, “_”, “/”, “(”, “)” y sin salto de línea. Se debe validar que el valor registrado no se encuentre en el catálogo AGENTE_LESION."
    },
    {
      "id": 45,
      "name": "lesionadoVehiculoMotor",
      "description": "Lesionado en caso de accidente de vehículo de motor",
      "type": {
        "kind": "numeric"
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Si el valor de la variable “agenteLesion” es “20 – VEHÍCULO DE MOTOR”, se debe registrar una de las siguientes opciones: 1 – CONDUCTOR 2 – OCUPANTE 3 – PEATÓN 4 – SE IGNORA En caso contrario, se debe registrar el valor “-1”. Si se registra el valor “1 – CONDUCTOR”, se debe validar que la edad del paciente sea mayor o igual a “15 años”."
    },
    {
      "id": 46,
      "name": "usoEquipoSeguridad",
      "description": "Uso equipo de seguridad",
      "type": {
        "kind": "numeric"
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Si el valor de la variable “lesionadoVehiculoMotor” es “1 – CONDUCTOR” o “2 – OCUPANTE”, se debe registrar una de las siguientes opciones: 1 – SI 2 – NO 9 – SE IGNORA En caso contrario, se debe registrar el valor “-1”."
    },
    {
      "id": 47,
      "name": "equipoUtilizado",
      "description": "¿Cuál fue el equipo utilizado?",
      "type": {
        "kind": "numeric"
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Si el valor de la variable “usoEquipoSeguridad” es “1 – SI”, se debe registrar una de las siguientes opciones: 1 – CINTURON DE SEGURIDAD 2 – CASCO 3 – SILLA PORTA INFANTE 4 – OTRO En caso contrario, se debe registrar el valor “-1”. Si se registra el valor “3 – SILLA PORTA INFANTE”, se debe validar que el valor de la variable “lesionadoVehiculoMotor” sea “2 – OCUPANTE” y la edad del paciente sea menor o igual a “5 años”."
    },
    {
      "id": 48,
      "name": "especifiqueEquipo",
      "description": "Especifique en caso de existir otro equipo utilizado diferente al catálogo.",
      "type": {
        "kind": "string",
        "maxLength": 50
      },
      "requiredColumn": false,
      "confidential": false,
      "validationRaw": "Si el valor de la variable “equipoUtilizado” es “4 – OTRO”, se debe registrar el nombre del equipo de seguridad utilizado. En caso contrario, se debe dejar vacío. Se deben omitir espacios en blanco al inicio y al final de la variable. Los caracteres válidos son 0 – 9, A – Z y Ñ en mayúsculas, sin acentos, sin caracteres especiales a excepción de “.”, “;”, “-”, “_”, “/”, “(”, “)” y sin salto de línea."
    },
    {
      "id": 49,
      "name": "tipoViolencia",
      "description": "Tipo de violencia",
      "type": {
        "kind": "string",
        "maxLength": 10
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Si el valor de la variable “intencionalidad” es “2 – VIOLENCIA FAMILIAR” o “3 – VIOLENCIA NO FAMILIAR”, se debe registrar al menos una de las siguientes opciones: 6 – VIOLENCIA FISICA 7 – VIOLENCIA SEXUAL 8 – VIOLENCIA PSICOLÓGICA 9 – VIOLENCIA ECONÓMICA / PATRIMONIAL 10 – ABANDONO Y/O NEGLIGENCIA En caso contrario, se debe registrar el valor “-1”. Se deben registrar como máximo 5 tipos de violencia. Si se identifica más de un tipo de violencia, los valores deben ir separados por “&”."
    },
    {
      "id": 50,
      "name": "numeroAgresores",
      "description": "Número de agresores",
      "type": {
        "kind": "numeric"
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Si el valor de la variable “intencionalidad” es “2 – VIOLENCIA FAMILIAR” o “3 – VIOLENCIA NO FAMILIAR”, se debe registrar una de las siguientes opciones: 1 – ÚNICO 2 – MÁS DE UNO 3 – NO ESPECIFICADO En caso contrario, se debe registrar el valor “-1”."
    },
    {
      "id": 51,
      "name": "parentescoAfectado",
      "description": "Parentesco del agresor con el paciente afectado",
      "type": {
        "kind": "numeric"
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Si el valor de la variable “intencionalidad” es “2 – VIOLENCIA FAMILIAR” o “3 – VIOLENCIA NO FAMILIAR” y el valor de la variable “numeroAgresores” es “1 – ÚNICO”, se debe registrar una de las siguientes opciones de parentesco. En caso contrario, se debe registrar el valor “-1”. Si el valor de la variable “intencionalidad” es “2 – VIOLENCIA FAMILIAR”, se debe registrar un valor diferente de “7 – CONOCIDO SIN PARENTESCO” y “8 – DESCONOCIDO”."
    },
    {
      "id": 52,
      "name": "sexoAgresor",
      "description": "Sexo del agresor",
      "type": {
        "kind": "numeric"
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Si el valor de la variable “numeroAgresores” es “1 – ÚNICO”, se debe registrar el valor del campo CATALOG_KEY que corresponda al sexo del agresor de acuerdo al catálogo SEXO. En caso contrario, se debe registrar el valor “-1”. Si no se identifica el sexo del agresor, se debe registrar el valor “9 – SE IGNORA”. Si no se encuentra descrito en la Hoja de Lesiones, se debe registrar el valor “0 – NO ESPECIFICADO”."
    },
    {
      "id": 53,
      "name": "edadAgresor",
      "description": "Edad del agresor en años",
      "type": {
        "kind": "numeric"
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Si el valor de la variable “numeroAgresores” es “1 – ÚNICO” y la edad del agresor es mayor o igual a 3 años y menor de 100 años, se debe registrar la edad correspondiente. En caso contrario, se debe registrar el valor “0”. Longitud máxima de 3 dígitos. Si el valor de la variable “parentescoAfectado” es diferente de “3 – CÓNYUGE / PAREJA / NOVIO” y se desconoce la edad del agresor, se debe registrar el valor “999”."
    },
    {
      "id": 54,
      "name": "agresorBajoEfectos",
      "description": "Se encontraba bajo efectos de alguna sustancia",
      "type": {
        "kind": "string",
        "maxLength": 5
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Si el valor de la variable “intencionalidad” es “2 – VIOLENCIA FAMILIAR” o “3 – VIOLENCIA NO FAMILIAR”, se debe registrar al menos una de las siguientes opciones: 1 – ALCOHOL 2 – DROGA POR INDICACION MEDICA 3 – DROGAS ILEGALES 4 – SE IGNORA 5 – NINGUNA En caso contrario, se debe registrar el valor “-1”. Se debe registrar como máximo 3 sustancias tóxicas. Si se identifica más de una sustancia tóxica, los valores deben ir separados por “&”."
    },
    {
      "id": 55,
      "name": "fechaAtencion",
      "description": "Fecha de la atención",
      "type": {
        "kind": "string",
        "maxLength": 10
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Se deben omitir espacios en blanco al inicio y al final de la variable. Debe contener el día, mes y año bajo el siguiente formato: dd/mm/aaaa. La longitud es de 8 dígitos y 2 caracteres especiales “/”. La fecha de atención debe ser mayor o igual a la fecha del evento. La fecha de atención no debe ser mayor a la fecha actual."
    },
    {
      "id": 56,
      "name": "horaAtencion",
      "description": "Hora de la atención",
      "type": {
        "kind": "string",
        "maxLength": 5
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "El registro de la hora de atención debe ser en horas y minutos en el siguiente formato de 24 horas: HH:MM. Si el valor de la variable “fechaEvento” es igual al valor de la variable “fechaAtencion”, la hora de atención debe ser mayor a la hora del evento. Si no se encuentra descrito en la Hoja de Lesiones, se debe registrar el valor “99:99”."
    },
    {
      "id": 57,
      "name": "servicioAtencion",
      "description": "¿Servicio que otorgo la atención?",
      "type": {
        "kind": "numeric"
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Se debe registrar una de las siguientes opciones: 1 – CONSULTA EXTERNA 2 – HOSPITALIZACION 3 – URGENCIAS 4 – SERVICIO ESPECIALIZADO DE ATENCION A LA VIOLENCIA 5 – OTRO SERVICIO"
    },
    {
      "id": 58,
      "name": "especifiqueServicio",
      "description": "Especifique a que otro servicio se refiere",
      "type": {
        "kind": "string",
        "maxLength": 50
      },
      "requiredColumn": false,
      "confidential": false,
      "validationRaw": "Si el valor de la variable “servicioAtencion” es “5 – OTRO SERVICIO”, se debe registrar el nombre del servicio de atención. En caso contrario, se debe dejar vacío. Se deben omitir espacios en blanco al inicio y al final de la variable. Los caracteres válidos son 0 – 9, A – Z y Ñ en mayúsculas, sin acentos, sin caracteres especiales y sin salto de línea. Se debe validar que el valor registrado no se encuentre en las opciones de la variable “servicioAtencion”."
    },
    {
      "id": 59,
      "name": "tipoAtencion",
      "description": "Tipo de atención",
      "type": {
        "kind": "string",
        "maxLength": 10
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Se debe registrar al menos una de las siguientes opciones: 1 – TRATAMIENTO MÉDICO 2 – TRATAMIENTO PSICOLÓGICO 3 – TRATAMIENTO QUIRÚRGICO 4 – TRATAMIENTO PSIQUIÁTRICO 5 – CONSEJERÍA 6 – OTRO 7 – PÍLDORA ANTICONCEPTIVA DE EMERGENCIA 8 – PROFILAXIS VIH 9 – PROFILAXIS OTRAS ITS Se debe registrar como máximo 5 tipos de atención. Si se identifica más de un tipo de atención, los valores deben ir separados por “&”."
    },
    {
      "id": 60,
      "name": "areaAnatomica",
      "description": "Área anatómica de mayor gravedad",
      "type": {
        "kind": "numeric"
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Se debe registrar el valor del campo CATALOG_KEY que corresponda al área anatómica de mayor gravedad de acuerdo al catálogo AREA_ANATOMICA. Únicamente se debe indicar el área afectada de mayor gravedad, en caso de haber múltiples afecciones se debe registrar el valor “15 – MÚLTIPLES”."
    },
    {
      "id": 61,
      "name": "especifiqueArea",
      "description": "Otra área anatómica diferente a los valores del catálogo",
      "type": {
        "kind": "string",
        "maxLength": 50
      },
      "requiredColumn": false,
      "confidential": false,
      "validationRaw": "Si el valor de la variable “areaAnatómica” es “16 – OTROS”, se debe registrar el nombre del área anatómica. En caso contrario, se debe dejar vacío. Se deben omitir espacios en blanco al inicio y al final de la variable. Los caracteres válidos son 0 – 9, A – Z y Ñ en mayúsculas, sin acentos, sin caracteres especiales a excepción de “.”, “;”, “-”, “_”, “/”, “(”, “)” y sin salto de línea. Se debe validar que el valor registrado no se encuentre en el catálogo AREA_ANATOMICA."
    },
    {
      "id": 62,
      "name": "consecuenciaGravedad",
      "description": "Consecuencia resultante de mayor gravedad",
      "type": {
        "kind": "numeric"
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Se debe registrar el valor del campo CATALOG_KEY que corresponda a la consecuencia resultante de acuerdo al catálogo CONSECUENCIA_LESION. Si el valor registrado es “7 – ABORTO” u “11 – EMBARAZO”, se debe validar que el valor de la variable “sexo” sea “2 - MUJER” y la edad se encuentre entre “9” y “59 años”."
    },
    {
      "id": 63,
      "name": "especifiqueConsecuencia",
      "description": "Otro tipo de consecuencia que no esté dentro de los valores del catálogo",
      "type": {
        "kind": "string",
        "maxLength": 50
      },
      "requiredColumn": false,
      "confidential": false,
      "validationRaw": "Si el valor de la variable “consecuenciaGravedad” es “22 – OTRA”, se debe registrar otra consecuencia de la lesión. En caso contrario, se debe dejar vacío. Se deben omitir espacios en blanco al inicio y al final de la variable. Los caracteres válidos son 0 – 9, A – Z y Ñ en mayúsculas, sin acentos, sin caracteres especiales a excepción de “.”, “;”, “-”, “_”, “/”, “(”, “)” y sin salto de línea. Se debe validar que el valor registrado no se encuentre en el catálogo CONSECUENCIA_LESION."
    },
    {
      "id": 64,
      "name": "descripcionAfeccionPrincipal",
      "description": "Descripción de la afección principal de la atención.",
      "type": {
        "kind": "string",
        "maxLength": 250
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Se deben omitir espacios en blanco al inicio y al final de la variable. Longitud mínima de 2 y máxima de 250 caracteres. El registro debe iniciar con un caracter alfabético. Los caracteres válidos son 0 – 9, A – Z y Ñ en mayúsculas, sin acentos, sin caracteres especiales a excepción de “.”, “,”, “;”, “-”, “_”, “/”, “(”, “)” y sin salto de línea. Texto libre con base en lo identificado por el profesional de la salud."
    },
    {
      "id": 65,
      "name": "codigoCIEAfeccionPrincipal",
      "description": "Código CIE de la Afección principal",
      "type": {
        "kind": "string",
        "maxLength": 4
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Se debe registrar el valor del campo CATALOG_KEY que corresponda al código de la CIE de acuerdo con el catálogo DIAGNOSTICO. Solo se pueden registrar códigos correspondientes al capítulo V, XIX y los códigos O04 – O07, O20, O267, O429, O468 – O469, O68, O710, O713 – O719."
    },
    {
      "id": 66,
      "name": "afeccionesTratadas",
      "description": "Variable compleja AFECCIONES TRATADAS (numeroAfeccion, descripcionAfeccion, codigoCIEAfeccion). Formato: Num#Desc#CodigoCIE por afección; múltiples separadas por &. Mín 1 máx 6. Si no aplican: vacío.",
      "type": {
        "kind": "string",
        "maxLength": 1530
      },
      "requiredColumn": false,
      "confidential": false,
      "validationRaw": "Se deben registrar como mínimo 1 y como máximo 6 afecciones cuando apliquen, compuestas por Número, Descripción y Código CIE separando cada uno con #, y cada afección con &. Si no aplican afecciones, el campo debe quedar vacío."
    },
    {
      "id": 67,
      "name": "afeccionPrincipalReseleccionada",
      "description": "Código CIE de la afección principal reseleccionada.",
      "type": {
        "kind": "string",
        "maxLength": 4
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Se debe registrar el valor del campo CATALOG_KEY que corresponda al código de la CIE de acuerdo con el catálogo DIAGNOSTICO. Si no existe una reselección de la afección principal, se debe registrar el valor de la variable “codigoCIEAfeccionPrincipal”."
    },
    {
      "id": 68,
      "name": "causaExterna",
      "description": "Descripción de los acontecimientos, circunstancias y condiciones que causaron la lesión.",
      "type": {
        "kind": "string",
        "maxLength": 250
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Se deben omitir espacios en blanco al inicio y al final de la variable. Longitud mínima de 2 y máxima de 250 caracteres. El registro debe iniciar con un caracter alfabético. Los caracteres válidos son 0 – 9, A – Z y Ñ en mayúsculas, sin acentos, sin caracteres especiales a excepción de “.”, “,”, “;”, “-”, “_”, “/”, “(”, “)” y sin salto de línea. Texto libre con base en lo identificado por el profesional de la salud."
    },
    {
      "id": 69,
      "name": "codigoCIECausaExterna",
      "description": "Código CIE de la Causa Externa (Solo en caso de Lesión)",
      "type": {
        "kind": "string",
        "maxLength": 4
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Se debe registrar el valor del campo CATALOG_KEY que corresponda al código de la CIE de acuerdo con el catálogo DIAGNOSTICO. Solo se deben registrar códigos correspondientes al capítulo XX que corresponden a las claves de la V01 – Y98 con sus respectivas subcategorías."
    },
    {
      "id": 70,
      "name": "despuesAtencion",
      "description": "Destino después de la atención",
      "type": {
        "kind": "numeric"
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Se debe registrar una de las siguientes opciones: 1 – DOMICILIO 2 – TRASLADO A OTRA UNIDAD MÉDICA 3 – SERVICIO ESPECIALIZADO ATENCION A LA VIOLENCIA 4 – CONSULTA EXTERNA 5 – DEFUNCION 6 – REFUGIO O ALBERGUE 7 – DIF 8 – HOSPITALIZACION 9 – MINISTERIO PUBLICO 10 – GRUPO DE AYUDA MUTUA 11 – OTRO Si el valor de la variable “consecuenciaGravedad” es “19 – DEFUNCIÓN” o se registra un diagnóstico de los grupos de la “O95” u “O96”, se debe registrar el valor “5 – DEFUNCIÓN”."
    },
    {
      "id": 71,
      "name": "especifiqueDestino",
      "description": "Especifica otro destino después de la atención",
      "type": {
        "kind": "string",
        "maxLength": 50
      },
      "requiredColumn": false,
      "confidential": false,
      "validationRaw": "Si el valor de la variable “despuesAtencion” es “11 – OTRO”, se debe registrar el nombre del destino después de la atención. En caso contrario, se debe dejar vacío. Se deben omitir espacios en blanco al inicio y al final de la variable. Los caracteres válidos son 0 – 9, A – Z y Ñ en mayúsculas, sin acentos, sin caracteres especiales a excepción de “.”, “;”, “-”, “_”, “/”, “(”, “)” y sin salto de línea. Se debe validar que el valor registrado no se encuentre en las opciones de la variable “despuesAtencion”."
    },
    {
      "id": 72,
      "name": "ministerioPublico",
      "description": "Dio aviso al Ministerio Público",
      "type": {
        "kind": "numeric"
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Se debe registrar una de las siguientes opciones: 1 – SI 2 – NO"
    },
    {
      "id": 73,
      "name": "folioCertificadoDefuncion",
      "description": "Folio del certificado de defunción",
      "type": {
        "kind": "string",
        "maxLength": 9
      },
      "requiredColumn": false,
      "confidential": false,
      "validationRaw": "Si el valor de la variable “despuesAtencion” es “5 – DEFUNCIÓN” y el valor de la variable “ministerioPublico” es “2 – NO”, se debe registrar el folio correspondiente. En caso contrario, se debe dejar vacío. Los primeros dos números del folio corresponden a los dos últimos dígitos del año de impresión y el tercer digito debe ser “0”, excepto para los formatos impresos en 2021 y 2022. La longitud debe ser de 9 dígitos. Los caracteres válidos son 0 – 9. NOTA: Solo se aceptarán folios de hasta 4 años anteriores y uno posterior a partir de la fecha de atención."
    },
    {
      "id": 74,
      "name": "responsableAtencion",
      "description": "Responsable de la atención",
      "type": {
        "kind": "numeric"
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Se debe registrar una de las siguientes opciones: 1 – MÉDICO TRATANTE 2 – PSICÓLOGO TRATANTE 3 – TRABAJADORA SOCIAL. Si el valor registrado es “1 – MÉDICO TRATANTE”, se debe validar que alguno de los valores de la variable “tipoAtencion” sea diferente de “2 – TRATAMIENTO PSICOLÓGICO” y “5 – CONSEJERÍA”."
    },
    {
      "id": 75,
      "name": "paisNacimiento",
      "description": "País de nacimiento del prestador de servicio de salud",
      "type": {
        "kind": "numeric"
      },
      "requiredColumn": true,
      "confidential": false,
      "validationRaw": "Se debe registrar el valor del campo CATALOG_KEY que corresponda al País de Nacimiento del prestador de servicios de acuerdo al catálogo PAIS."
    },
    {
      "id": 76,
      "name": "curpResponsable",
      "description": "Clave Única de Registro del profesional de salud responsable de la atención",
      "type": {
        "kind": "string",
        "maxLength": 18
      },
      "requiredColumn": true,
      "confidential": true,
      "validationRaw": "Se deben omitir espacios al inicio y al final de la variable. Debe ir en mayúsculas y debe estar validada por RENAPO. Se debe validar que el valor de la variable cumpla con la estructura “AAAA999999AAAAAAX9”. Deben tener coincidencia con las variables: “nombreResponsable”, “primerApellidoResponsable” y “segundoApellidoResponsable”. La CURP del profesional de salud responsable de la atención debe ser diferente de la CURP del Paciente a excepción del valor genérico. Si el valor de la variable “paisNacimiento” es diferente de “142 – MÉXICO”, se podrá asignar a la variable el valor genérico “XXXX999999XXXXXX99”."
    },
    {
      "id": 77,
      "name": "nombreResponsable",
      "description": "Nombre del profesional de salud responsable de la atención",
      "type": {
        "kind": "string",
        "maxLength": 50
      },
      "requiredColumn": true,
      "confidential": true,
      "validationRaw": "La longitud máxima es de 50 caracteres. Debe tener al menos dos caracteres. Los caracteres válidos son sólo de A – Z, incluyendo Ñ, en mayúsculas. En caso de nombre compuesto, debe ir separado por un espacio o en su caso “-”, “,” o “.” y no se acepta ningún otro tipo de carácter especial, ni acentos. Esta variable se debe validar contra el valor registrado en la variable “curpResponsable”."
    },
    {
      "id": 78,
      "name": "primerApellidoResponsable",
      "description": "Primer apellido del profesional que proporcionó la atención",
      "type": {
        "kind": "string",
        "maxLength": 50
      },
      "requiredColumn": true,
      "confidential": true,
      "validationRaw": "La longitud máxima es de 50 caracteres. Debe tener al menos dos caracteres. Se deben omitir espacios en blanco al inicio y al final de la variable. Los caracteres válidos son sólo de A – Z, incluyendo Ñ, en mayúsculas. En caso de apellido compuesto, debe ir separado por un espacio o en su caso “-”, “,” o “.” y no se acepta ningún otro tipo de carácter especial, ni acentos. Esta variable se debe validar contra el valor registrado en la variable “curpResponsable”."
    },
    {
      "id": 79,
      "name": "segundoApellidoResponsable",
      "description": "Segundo apellido del profesional que proporcionó la atención",
      "type": {
        "kind": "string",
        "maxLength": 50
      },
      "requiredColumn": true,
      "confidential": true,
      "validationRaw": "La longitud máxima es de 50 caracteres. Debe tener al menos dos caracteres. Se deben omitir espacios en blanco al inicio y al final de la variable. Los caracteres válidos son sólo de A – Z, incluyendo Ñ, en mayúsculas. En caso de apellido compuesto, debe ir separado por un espacio o en su caso “-”, “,” o “.” y no se acepta ningún otro tipo de carácter especial, ni acentos. Esta variable se debe validar contra el valor registrado en la variable “curpResponsable”. En caso de no contar con el segundo apellido, se debe registrar el valor “XX”."
    },
    {
      "id": 80,
      "name": "cedulaResponsable",
      "description": "Cédula profesional del médico responsable que proporcionó la atención",
      "type": {
        "kind": "string",
        "maxLength": 14
      },
      "requiredColumn": true,
      "confidential": true,
      "validationRaw": "Se deben omitir espacios en blanco al inicio y al final de la variable. Longitud mínima de 6 y máxima de 14 caracteres. Los caracteres válidos son 0 – 9, A – Z y Ñ, en mayúsculas, sin acentos, ni caracteres especiales. Si la cédula tiene una longitud menor a “6” caracteres, se debe rellenar con ceros a la izquierda. En caso de no contar con el dato, se debe registrar el valor “0”."
    }
  ]
}